app/controllers/microposts_controller.rb

INSERT INTO "microposts" ("content", "picture", "user_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["content", "Holla holla "], ["picture", "-purple-seascape.jpg"], ["user_id", 1], ["created_at", "2016-05-19 21:36:44.160453"], ["updated_at", "2016-05-19 21:36:44.160453"]]
---
  def create
    @micropost = current_user.microposts.build(micropost_params)
    if @micropost.save

DELETE FROM "microposts" WHERE "microposts"."id" = $1  [["id", 259]]
---
  def destroy
   @micropost.delete