app/controllers/password_resets_controller.rb

   def update
     if password_blank?
       flash.now[:danger] = "Password can't be blank"
       render 'edit'
     elsif @user.update_attributes(user_params)
---
UPDATE "users" SET "password_digest" = ?, "updated_at" = ? WHERE "users"."id" = ?  [["password_digest", "$2a$10$GHQ.J89hdg55h9pK5oNwGOcRtmudwNq1bRCNqrabrQoVumieOnPuu"], ["updated_at", "2016-05-12 20:08:01.174378"], ["id", 1]]