app/controllers/sessions_controller.rb

  def create
    # firstly find user by email and create session which we assing to user
    user = User.find_by(email: params[:session][:email])
---
SELECT  "users".* FROM "users" WHERE "users"."email" = ? LIMIT 1  [["email", ""]]