app/controllers/users_controller.rb

SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT 1  [["id", 1]]
SELECT  "microposts".* FROM "microposts" WHERE "microposts"."user_id" = $1  ORDER BY "microposts"."created_at" DESC LIMIT 30 OFFSET 0  [["user_id", 1]]
SELECT  "users".* FROM "users"  ORDER BY "users"."id" ASC LIMIT 1
SELECT COUNT(*) FROM "microposts" WHERE "microposts"."user_id" = $1  [["user_id", 1]]
---
  def show
    @user = User.find(params[:id])
    @microposts = @user.microposts.paginate(page: params[:page])

INSERT INTO "users" ("name", "nickname", "email", "password_digest", "created_at", "updated_at", "activation_digest") VALUES ($1, $2, $3, $4, $5, $6, $7) RETURNING "id"
---
  def create
    @user = User.new(user_params)
    if @user.save

UPDATE "users" SET "name" = ?, "nickname" = ?, "updated_at" = ? WHERE "users"."id" = ?  [["name", "James"], ["nickname", "Muller"], ["updated_at", "2016-05-04 17:09:04.286105"], ["id", 3]]
---
 def update
  #  @user = User.find(params[:id])
   if @user.update_attributes(user_params)